vegeta-cli/src/vegeta/aeromant/templates/aircraft_rotor_disks/com/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ({{VELOCITY}} 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ({{VELOCITY}} 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform ({{VELOCITY}} 0 0);
    }
    sides
    {
        type            slip;
    }
    "body.*"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
